Autodesk.Revit.DB.IFCCategoryTemplate.SetActiveTemplate(Autodesk.Revit.DB.Document)
Sets the mapping template element to be the active mapping template in the document.
document:
The document to set.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2025